{
    "bikes":[
        {
            "id":"1",
            "name":"Hero XPulse 200 4V",
            "category":"Hero",
            "Engine Capacity":"199.6 CC",
            "Mileage":"40 KM/L",
            "Fuel Tank Capacity":"13.0 L",
            "Gears":"5 Speed",
            "Brakes":"Disc/Disc",
            "Starting Mechanism":"Self / Kick Start",
            "Wheel Type":"Spoke Wheels",
            "Body Type":"Off Road",
            "description":"The Hero XPulse 200 is an adventure motorcycle that was launched in India in 2019. It is designed to provide a thrilling riding experience both on and off the road, making it a popular choice among adventure enthusiasts. The XPulse 200 features a rugged and robust design, with high ground clearance and long-travel suspension to tackle rough terrains with ease. It is equipped with a powerful 200cc, air-cooled engine that delivers a good balance of power and efficiency. The engine is mated to a 5-speed gearbox, providing smooth gear shifts and optimal performance in various riding conditions. With its off-road-friendly features, the XPulse 200 is well-equipped to handle adventure trails. It comes with knobby tires for superior traction, a high-mounted exhaust for better water wading capability, and a protective skid plate to shield the engine from obstacles.",
            "cover image":"https://radwaamer.sirv.com/bikes/bike1/1.webp",
            "small image":"https://radwaamer.sirv.com/bikes/bike1/1-sm.jpeg",
            "price":{
                "start":"₹ 1.44",
                "end":"₹ 1.51"
            },
            "colors":[
                {
                    "name":"Hero XPulse 200 4V Pro White",
                    "color":"#FFFEFF",
                    "image":"https://radwaamer.sirv.com/bikes/bike1/1-white.webp",
                    "availability":true
                },
                {
                    "name":"Hero XPulse 200 4V Sports Red",
                    "color":"#D42123",
                    "image":"https://radwaamer.sirv.com/bikes/bike1/1-red.webp",
                    "availability":false
                },
                {
                    "name":"Hero XPulse 200 4V Matt Nexus Blue",
                    "color":"#43599B",
                    "image":"https://radwaamer.sirv.com/bikes/bike1/1-blue1.webp",
                    "availability":true
                },
                {
                    "name":"Hero XPulse 200 4V Techno Blue",
                    "color":"#004F8C",
                    "image":"https://radwaamer.sirv.com/bikes/bike1/1-blue2.webp",
                    "availability":true
                }
            ],
            "images":[
                "https://radwaamer.sirv.com/bikes/bike1/1-1.webp",
                "https://radwaamer.sirv.com/bikes/bike1/1-2.webp",
                "https://radwaamer.sirv.com/bikes/bike1/1-3.webp",
                "https://radwaamer.sirv.com/bikes/bike1/1-4.webp",
                "https://radwaamer.sirv.com/bikes/bike1/1-5.webp"
            ],
            "reviews":[
                {
                    "name":"LaPulga",
                    "date":"May 15, 2024 09:15 AM",
                    "rate":"5.0",
                    "title":"Long Term review after 2 years of riding",
                    "comment":"32k on the odo, not a single issue with the the bike. Rear wheel was changed at 24k, planning to change the front one soon. Chainset was changed at 19k and 31k. The brake pads especially rear one are changed frequently, my daily commute involves driving 15 kms on the hwy at speeds more than 110 kmph which is why average is 30-32, hwy touring at 95-100 kmph easily gets you 36 kmpl, great at eating bumps, the front wheel does not have a very good wheelbase which is why you gotta be careful while doing offroads or undulations."
                }
            ],
            "expert review":{
                "rating":{
                    "design":8.5,
                    "Safety":8.0,
                    "Comfort":8.5,
                    "Performance":8.0,
                    "Significance":9.5,
                    "Value For Money":8.8,
                    "Fuel Consumption":8.8
                },
                "pros":[
                    "Comfortable ergonomics",
                    "Refined engine",
                    "Most affordable ADV"
                ],
                "cons":[
                    "Better brakes",
                    "High seat height",
                    "Lacks top-end punch"
                ],
                "verdict":"Possibly the most recognisable and popular product in the market currently, the Hero Xpulse 200 4V is the most affordable entry-level ADV. Out of the numerous positives, the motorycle has possibly the most refined engine in the segment, with superior ergonomics aiding young riders as well as seasoned riders. But, the cons are equally worrying as better set of brakes, and a lower seat would've helped. Plus the lack of top-end torque doesn't really work in the case of an ADV.",
                "description":"<div><h3>Hero XPulse 200 4V</h3><p>The Hero Xpulse 200 4V is a potent and powerful model that can actually be a great pick for several types of buyers. Here’s delving deeper into its key features and USPs.</p><h3>How is the design?</h3><p>The New Hero XPulse 200 4V has a rugged design, a high ground clearance, and wire-spoke wheels, giving it an appearance that is reminiscent of an actual off-roading expedition. The manufacturer has equipped it with a mudguard that is situated high on the frame and a front suspension that has a significant amount of travel. The light coming from the vehicle's headlight is provided by an LED array. The level of brightness emitted by the light is satisfactory; however, its throw may be enhanced. In addition, the knuckle protectors for the handlebars at the front of the XPulse 200 are another feature that contributes to its rugged off-road appearance. Because it has a fixed windscreen up front, it is possible for the rider to travel at highway speeds without experiencing any discomfort.</p><p>The imposing appearance is carried over to the side and rear profiles, which both feature a significant amount of ground clearance as well as a sculpted fuel tank that features appealing body embellishments. In addition to this, the underbelly of the motorcycle has been upgraded to include a larger metal bash plate, which does a better job of protecting the powertrain while the motorcycle is being driven off-road. An extended rear fender, LED tail lights, and dual-purpose tyres are all seen in the profile view of the vehicle's rear. Because of its wide handlebars and foot pegs that are positioned in a neutral position, the Hero XPulse 200 enables riders to adopt a more upright riding stance. On the other hand, it has a very small saddle, which might make traveling for extended periods of time uncomfortable.</p><h3>How is the performance?</h3><p>The brand new XPulse 200 4V was introduced by Hero MotoCorp and has a starting price of 1.35 lakh rupees (ex-showroom, Delhi). The entry-level adventure motorcycle, the Hero XPulse 200 4V, now features four-valve technology as part of a comprehensive update that also includes a variety of other enhancements. The single-cylinder, oil-cooled engine that has a capacity of 199.6 cc now features a four-valve head and generates 19.1 PS at 8,500 revolutions per minute (rpm). The engine's peak torque is 17.35 Nm and it is achieved at 6,500 rpm. There has been a six percent increase in power while there has been a five percent increase in torque. The XPulse 200 4V has also seen a price increase of Rs. 5,000 in comparison to the version with two valves, which was previously available. This engine is coupled to a gearbox that has five different speeds. A seven-fin oil cooler is included as part of the cooling system, which provides for improved heat management in densely populated areas.</p><h3>How does the motorbike ride?</h3><p>The bike performs very well and feels comfortable on the trail. The chassis is tall and thin, which helps it ride well on a variety of terrains. Its suspension is also adjustable, which helps it ride comfortably on rough roads. The engine on the Hero XPulse 200 is a four-valve unit that offers better airflow and more efficient combustion. It is lighter and has smaller valves. As a result, it produces less pollution and revs higher.The new 4V can reach a top speed of around 115 km/h and has a cruising speed of around 100kph. However, riding at higher speeds will strain the engine and reduce fuel efficiency. You should keep this in mind when purchasing the bike. The fuel efficiency is slightly lower than the previous model.</p><p>The Hero XPulse 200 4v bike has received several updates since it first came out. The headlight has been upgraded to 20% brighter than the previous model, and the seat has been padded to improve comfort. The new model also has a more conventional high beam switch. However, the new switchgear looks cheap. It also has a toothed foot brake pedal.</p><h3>How comfortable the motorbike is?</h3><p>The Hero XPulse 200 4v bike comes with an aggressive styling and good ground clearance. It also has a high-mounted mudguard and a front suspension with substantial travel. While the bike feels comfortable enough for a leisurely commute, it struggles when pushed beyond the safe 85-90kmph speed range. The new design is a welcome change from the previous model, but the switchgear still looks cheap.</p><p>The new gearing on the Hero XPulse 200 4v bike improves its off-road capabilities and makes it more comfortable to ride. The larger rear sprocket complements the revised gear ratios and improves the overall ride quality. The XPulse 200's seat is roomy enough for the rider and the pillion. The expanded gear lever and the longer side stand ensure that the necessary finer details are attended to. The spoked front wheel measures 21 inches and the rear wheel measures 18 inches, and both are equipped with dual-purpose tires that are optimized for use on and off road. The motorcycle comes standard with these features. There is a toothed brake pedal for maximum grip and control, while an upswept exhaust is also present. The motorcycle is equipped with an aluminium skid plate that protects the engine. The motorcycle has a taller front suspension that is fully adjustable and has a travel distance of 250 mm, as well as a fully adjustable 10-step rear suspension that has a travel distance of 220 mm. This provides the rider with the ability to fine-tune the suspension to suit the terrain as well as their own riding style.</p><h3>How’s the tech?</h3><p>The new Hero XPulse 200 4K bike comes with a host of new tech. It features a Bluetooth-enabled instrument cluster and under seat USB charging. It also has LED headlights. While the low-beam spread is decent, the high-beam reach is a little short.</p><p>The XPulse 200 4V comes with improved acceleration. You can expect the bike to be able to hold a cruising speed of 100kph. However, higher speeds will put more strain on the engine. As a result, the new bike's fuel efficiency is slightly lower than the previous model.</p><h3>How’s the mileage of the motorbike?</h3><p>The new Hero XPulse 200 4V can reach its top speed of 115 kilometers per hour. In terms of mileage, you may expect to get between 38 and 40 kilometers per liter. This estimate, however, is subject to change depending on a variety of circumstances, such as the terrain you drive on and your driving style.</p><h3>Is the motorbike good value for Money?</h3><p>The Hero XPulse 200 is an affordably priced bike and suits urban environments. The frame of the bike is reasonably sturdy, and it is able to perform admirably on most roads. The bike stands out due to its high ground clearance, competent chassis characteristics, and lightweight construction.</p><p>Trail Blue, Blitz Blue, and Red Raid are the names of the three new colour schemes that are included with the 2022 Hero XPulse 200 4V. An integrated starter and engine cut-off switch have also been added to the switchgear as part of the recent update that was performed on it. Other features, such as a more powerful LED headlamp, an LED taillight, an instrument console that is enabled with Bluetooth, a single-channel ABS system, and more, have remained the same.</p><h3>How is the after sales service?</h3><p>The operation of a two-wheeler should be trouble free, and its performance should be at its highest possible level. Hero MotoCorp provides free services on all of its two-wheelers because the company understands the importance of proper care and maintenance. You are obligated to make use of these services within the predetermined parameters of either the allotted amount of time or the specified number of kilometers, depending on which condition is satisfied the soonest from the date of purchase. After the duration of the free services or the period during which the free services were valid, you will be required to continue making use of the paid services in accordance with the recommended service schedule.</p><p>Hero MotoCorp, the largest manufacturer of motorbikes and scooters in the world, has announced the debut of a comprehensive range of sales and aftersales services on the social networking platform WhatsApp. Customers will soon be able to benefit from a plethora of services that can be accessed 24 hours a day, seven days a week through the use of a chatbot that features user-friendly navigation menus and can be accessed via WhatsApp.</p><p>With the help of this brand-new effort, the company will now be able to provide its modern, tech-savvy clients with an interaction that is streamlined and simple to access. The services that will be provided include those that are transactional, instructive, and location-based. Customers can take use of this amenity by either dialling the number +918367796950 from their mobile devices or scanning the QR code that is located at each and every Hero MotoCorp customer touch-point. After the feature has been activated, users can begin the chat whenever they like during the day and take advantage of the various services that are made available for them.</p><h3>Which Motorbikes Compete in this Segment?</h3><p>The Hero Xpulse 200 4V competes with rivals like the Yamaha MT-15, TVS Apache RTR 200 4V, Honda CB200X, and others.</p><h3>Verdict (Is it Value for Money?)</h3><p>The Hero XPulse 200 4V is an entry-level motorcycle that is unlike any other model on the market. It has the capability to go on adventures, but it can also handle everyday tasks quite capably. It has a versatile personality that allows it to do everything. And now, the Hero XPulse 200 receives its first significant update, and it's not just a new colour scheme or some fancy new graphics; it's a lot more than that. The 199.6 cc single-cylinder engine is the component that has undergone the most substantial transformation. It now has a four-valve head and provides only minimal increases in power and torque. Even though recent improvements have made the XPulse 200 4V a more suitable vehicle for commuting, it still does not have the power necessary for riding on the highway for extended stretches. Not to mention the fact that the suspension system has been altered, which has resulted in the bike being even more comfortable now. When it was first released, the XPulse 200 4V had a price that was only Rs 5,000 more than its predecessor, which was the case when compared to the prior model. The XPulse is still the best choice for someone who is just getting started in the world of adventure riding, despite the fact that we would have liked it to have a bit more grunt given its current price point and other abilities.</p></div>"
            },
            "prices":[
                {
                    "city":"New Delhi",
                    "price":"₹ 1,51,878"
                },
                {
                    "city":"Mumbai",
                    "price":"₹ 1,56,184"
                },
                {
                    "city":"Bangalore",
                    "price":"₹ 1,63,359"
                },
                {
                    "city":"Hyderabad",
                    "price":"₹ 1,59,054"
                },
                {
                    "city":"Chennai",
                    "price":"₹ 1,57,619"
                },
                {
                    "city":"Kolkata",
                    "price":"₹ 1,50,823"
                },
                {
                    "city":"Ahmedabad",
                    "price":"₹ 1,54,748"
                }
            ]
        }
    ],
    "categories":["Hero","Royal","Bajaj","Yamaha","Honda","TVS","Kawasaki","Suzuki","KTM"]
}